fdr/src/test/resources/requests/activateIOPayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForIO.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <nod:activateIOPaymentReq>
            <idPSP>{psp}</idPSP>
            <idBrokerPSP>{brokerPsp}</idBrokerPSP>
            <idChannel>{channel}</idChannel>
            <password>{channelPwd}</password>
            {idempotencyKey}
            <qrCode>
                <fiscalCode>{pa}</fiscalCode>
                <noticeNumber>{noticeNumber}</noticeNumber>
            </qrCode>
            <expirationTime>120000</expirationTime>
            <amount>{amount}</amount>
            <dueDate>2021-10-28</dueDate>
            <paymentNote>Test payment</paymentNote>
            <payer>
                <uniqueIdentifier>
                    <entityUniqueIdentifierType>F</entityUniqueIdentifierType>
                    <entityUniqueIdentifierValue>CCCFFFDDDEEF</entityUniqueIdentifierValue>
                </uniqueIdentifier>
                <fullName>asdasd</fullName>
                <!--Optional:-->
                <streetName>hh56h</streetName>
                <!--Optional:-->
                <civicNumber>45</civicNumber>
                <!--Optional:-->
                <postalCode>55544</postalCode>
                <!--Optional:-->
                <city>hyhhyth</city>
                <!--Optional:-->
                <stateProvinceRegion>yhyh</stateProvinceRegion>
                <!--Optional:-->
                <country>IT</country>
                <!--Optional:-->
                <e-mail>sdfsdfsdf@fsdf.it</e-mail>
            </payer>

        </nod:activateIOPaymentReq>
    </soapenv:Body>
</soapenv:Envelope>
